"""
[아크릴] 사물 촬영 및 바운딩 (1587) 주간보고
"""
from crowdworks.commonUtil import *

import os
import shutil
import json
import uuid
import openpyxl


def switch(x):
    return {
        1933: "발코니_베란다/",
        1942: "욕실/",
        1944: "침실/",
        1945: "옷방/",
        1946: "식사실/",
        1947: "현관/",
        1948: "아이방/",
        1949: "주방/",
        1950: "거실/",
        1951: "서재_공부방/",
        1952: "다용도실/",
        1953: "실내/"
    }.get(x, False)


item_list = {"스마트폰": 0, "태블릿": 0, "스마트워치": 0, "무선이어폰": 0, "헤드폰": 0, "VR기기": 0, "무선충전기": 0, "티비(모니터포함)": 0, "사운드바": 0,
             "스피커": 0, "프린터": 0, "노트북": 0, "마우스": 0, "키보드": 0, "냉장고": 0, "오븐": 0, "전자레인지": 0, "인덕션": 0, "식기세척기": 0,
             "스탠드에어컨": 0, "벽걸이에어컨": 0, "시스템에어컨": 0, "드럼세탁기": 0, "전자동세탁기": 0, "건조기": 0, "의류관리기": 0, "무선 청소기": 0,
             "유선 청소기": 0, "로봇청소기": 0, "공기청정기": 0, "가습기": 0, "헤어드라이어": 0, "침대": 0, "화장대": 0, "스탠드옷걸이": 0, "옷장": 0,
             "서랍": 0, "놀이매트": 0, "책상": 0, "의자": 0, "책장": 0, "소파": 0, "TV 장식장": 0, "리모콘": 0, "카펫": 0, "피아노": 0,
             "실내자전기": 0, "선풍기": 0, "테이블": 0, "싱크볼": 0, "커피머신": 0, "조리기구": 0, "토스터기": 0, "밥솥": 0, "욕조": 0, "세면대": 0,
             "샤워기": 0, "변기": 0, "사람": 0, "강아지": 0, "고양이": 0}
task_id_list = "1933, 1942, 1944, 1945, 1946, 1947, 1948, 1949, 1950, 1951, 1952, 1953"

sql_result_json = "SELECT result_json FROM TB_PRJ_DATA WHERE prj_idx in (" + task_id_list + ") AND prog_state_cd='ALL_FINISHED'"
result_json = getDatabaseData(sql_result_json, "", "", "")

for result in result_json:
    # str > dict
    result_dict = json.loads(result[0])

    for label in result_dict['label-list']:
        try:
            for item in item_list:
                if label['label'] == item:
                    item_list[item] = item_list[item] + 1
        except KeyError:
            print(result_dict['fileId'])
            # prj_idx 16876106 의 result_json['label-list'] 에 'label' key 가 없당...
            pass

# workbook 생성
wb = openpyxl.Workbook()
wb_detail = wb.create_sheet('상세')
index = 0
for item in item_list:
    index = index + 1

    name_key = "A" + str(index)
    value_key = "B" + str(index)

    wb['Sheet'][name_key] = item
    wb['Sheet'][value_key] = item_list[item]

# wb.close()
# wb.save('아크릴_데이터_수량_요약.xlsx')

# 상세는 아예 따로 돌릴깡...
item_list_detail = {
    "1933": {"스마트폰": 0, "태블릿": 0, "스마트워치": 0, "무선이어폰": 0, "헤드폰": 0, "VR기기": 0, "드럼세탁기": 0, "전자동세탁기": 0, "건조기": 0,
             "무선 청소기": 0, "유선 청소기": 0, "로봇청소기": 0, "서랍": 0, "리모콘": 0, "카펫": 0, "실내자전기": 0, "선풍기": 0, "사람": 0, "강아지": 0,
             "고양이": 0},
    "1942": {"스마트폰": 0, "태블릿": 0, "스마트워치": 0, "무선이어폰": 0, "헤드폰": 0, "VR기기": 0, "스피커": 0, "드럼세탁기": 0, "전자동세탁기": 0,
             "건조기": 0, "헤어드라이어": 0, "서랍": 0, "리모콘": 0, "욕조": 0, "세면대": 0, "샤워기": 0, "변기": 0, "사람": 0, "강아지": 0,
             "고양이": 0},
    "1944": {"스마트폰": 0, "태블릿": 0, "스마트워치": 0, "무선이어폰": 0, "헤드폰": 0, "VR기기": 0, "무선충전기": 0, "티비(모니터포함)": 0, "사운드바": 0,
             "스피커": 0, "프린터": 0, "노트북": 0, "마우스": 0, "키보드": 0, "스탠드에어컨": 0, "벽걸이에어컨": 0, "시스템에어컨": 0, "건조기": 0,
             "의류관리기": 0, "무선 청소기": 0, "유선 청소기": 0, "로봇청소기": 0, "공기청정기": 0, "가습기": 0, "헤어드라이어": 0, "침대": 0, "화장대": 0,
             "스탠드옷걸이": 0, "옷장": 0, "서랍": 0, "놀이배트": 0, "책상": 0, "의자": 0, "책장": 0, "소파": 0, "TV 장식장": 0, "리모콘": 0,
             "카펫": 0, "피아노": 0, "실내자전기": 0, "선풍기": 0, "커피머신": 0, "사람": 0, "강아지": 0, "고양이": 0},
    "1945": {"스마트폰": 0, "태블릿": 0, "스마트워치": 0, "무선이어폰": 0, "헤드폰": 0, "VR기기": 0, "무선충전기": 0, "스피커": 0, "노트북": 0, "마우스": 0,
             "키보드": 0, "스탠드에어컨": 0, "벽걸이에어컨": 0, "시스템에어컨": 0, "건조기": 0, "의류관리기": 0, "무선 청소기": 0, "유선 청소기": 0,
             "로봇청소기": 0, "공기청정기": 0, "가습기": 0, "헤어드라이어": 0, "화장대": 0, "스탠드옷걸이": 0, "옷장": 0, "서랍": 0, "책상": 0, "의자": 0,
             "책장": 0, "소파": 0, "리모콘": 0, "카펫": 0, "피아노": 0, "실내자전기": 0, "선풍기": 0, "사람": 0, "강아지": 0, "고양이": 0, },
    "1946": {"스마트폰": 0, "태블릿": 0, "스마트워치": 0, "무선이어폰": 0, "헤드폰": 0, "VR기기": 0, "무선충전기": 0, "스피커": 0, "냉장고": 0, "오븐": 0,
             "전자레인지": 0, "무선 청소기": 0, "유선 청소기": 0, "로봇청소기": 0, "공기청정기": 0, "가습기": 0, "서랍": 0, "리모콘": 0, "카펫": 0,
             "선풍기": 0, "테이블": 0, "싱크볼": 0, "커피머신": 0, "조리기구": 0, "토스터기": 0, "밥솥": 0, "사람": 0, "강아지": 0, "고양이": 0},
    "1947": {"스마트폰": 0, "태블릿": 0, "스마트워치": 0, "무선이어폰": 0, "헤드폰": 0, "VR기기": 0, "무선충전기": 0, "티비(모니터포함)": 0, "사운드바": 0,
             "스피커": 0, "프린터": 0, "노트북": 0, "마우스": 0, "키보드": 0, "냉장고": 0, "오븐": 0, "전자레인지": 0, "식기세척기": 0, "스탠드에어컨": 0,
             "벽걸이에어컨": 0, "시스템에어컨": 0, "드럼세탁기": 0, "전자동세탁기": 0, "건조기": 0, "의류관리기": 0, "무선 청소기": 0, "유선 청소기": 0,
             "로봇청소기": 0, "공기청정기": 0, "가습기": 0, "헤어드라이어": 0, "화장대": 0, "스탠드옷걸이": 0, "옷장": 0, "서랍": 0, "놀이배트": 0, "책상": 0,
             "의자": 0, "책장": 0, "소파": 0, "TV 장식장": 0, "리모콘": 0, "카펫": 0, "피아노": 0, "실내자전기": 0, "선풍기": 0, "테이블": 0,
             "커피머신": 0, "조리기구": 0, "토스터기": 0, "밥솥": 0, "사람": 0, "강아지": 0, "고양이": 0},
    "1948": {"스마트폰": 0, "태블릿": 0, "스마트워치": 0, "무선이어폰": 0, "헤드폰": 0, "VR기기": 0, "무선충전기": 0, "티비(모니터포함)": 0, "사운드바": 0,
             "스피커": 0, "스탠드에어컨": 0, "벽걸이에어컨": 0, "시스템에어컨": 0, "건조기": 0, "의류관리기": 0, "무선 청소기": 0, "유선 청소기": 0,
             "로봇청소기": 0, "공기청정기": 0, "가습기": 0, "헤어드라이어": 0, "스탠드옷걸이": 0, "옷장": 0, "서랍": 0, "놀이배트": 0, "소파": 0, "리모콘": 0,
             "피아노": 0, "실내자전기": 0, "선풍기": 0, "사람": 0, "강아지": 0, "고양이": 0},
    "1949": {"스마트폰": 0, "태블릿": 0, "스마트워치": 0, "무선이어폰": 0, "헤드폰": 0, "VR기기": 0, "무선충전기": 0, "티비(모니터포함)": 0, "스피커": 0,
             "냉장고": 0, "오븐": 0, "전자레인지": 0, "인덕션": 0, "식기세척기": 0, "시스템에어컨": 0, "무선 청소기": 0, "유선 청소기": 0, "로봇청소기": 0,
             "공기청정기": 0, "가습기": 0, "서랍": 0, "리모콘": 0, "카펫": 0, "피아노": 0, "실내자전기": 0, "선풍기": 0, "싱크볼": 0, "커피머신": 0,
             "조리기구": 0, "토스터기": 0, "밥솥": 0, "사람": 0, "강아지": 0, "고양이": 0},
    "1950": {"스마트폰": 0, "태블릿": 0, "스마트워치": 0, "무선이어폰": 0, "헤드폰": 0, "VR기기": 0, "무선충전기": 0, "티비(모니터포함)": 0, "사운드바": 0,
             "스피커": 0, "프린터": 0, "노트북": 0, "마우스": 0, "키보드": 0, "냉장고": 0, "오븐": 0, "전자레인지": 0, "스탠드에어컨": 0, "벽걸이에어컨": 0,
             "시스템에어컨": 0, "건조기": 0, "의류관리기": 0, "무선 청소기": 0, "유선 청소기": 0, "로봇청소기": 0, "공기청정기": 0, "가습기": 0, "헤어드라이어": 0,
             "스탠드옷걸이": 0, "서랍": 0, "놀이배트": 0, "책상": 0, "의자": 0, "책장": 0, "소파": 0, "TV 장식장": 0, "리모콘": 0, "카펫": 0,
             "피아노": 0, "실내자전기": 0, "선풍기": 0, "커피머신": 0, "토스터기": 0, "사람": 0, "강아지": 0, "고양이": 0},
    "1951": {"스마트폰": 0, "태블릿": 0, "스마트워치": 0, "무선이어폰": 0, "헤드폰": 0, "VR기기": 0, "무선충전기": 0, "티비(모니터포함)": 0, "사운드바": 0,
             "스피커": 0, "프린터": 0, "노트북": 0, "마우스": 0, "키보드": 0, "스탠드에어컨": 0, "벽걸이에어컨": 0, "시스템에어컨": 0, "무선 청소기": 0,
             "유선 청소기": 0, "로봇청소기": 0, "공기청정기": 0, "가습기": 0, "헤어드라이어": 0, "스탠드옷걸이": 0, "옷장": 0, "서랍": 0, "놀이배트": 0,
             "책상": 0, "의자": 0, "책장": 0, "소파": 0, "리모콘": 0, "카펫": 0, "피아노": 0, "실내자전기": 0, "선풍기": 0, "커피머신": 0, "사람": 0,
             "강아지": 0, "고양이": 0},
    "1952": {"스마트폰": 0, "태블릿": 0, "스마트워치": 0, "무선이어폰": 0, "헤드폰": 0, "VR기기": 0, "무선충전기": 0, "스피커": 0, "냉장고": 0, "오븐": 0,
             "전자레인지": 0, "식기세척기": 0, "드럼세탁기": 0, "전자동세탁기": 0, "건조기": 0, "의류관리기": 0, "무선 청소기": 0, "유선 청소기": 0,
             "로봇청소기": 0, "헤어드라이어": 0, "스탠드옷걸이": 0, "서랍": 0, "리모콘": 0, "카펫": 0, "커피머신": 0, "조리기구": 0, "토스터기": 0, "밥솥": 0,
             "사람": 0, "강아지": 0, "고양이": 0},
    "1953": {"스마트폰": 0, "태블릿": 0, "스마트워치": 0, "무선이어폰": 0, "헤드폰": 0, "VR기기": 0, "무선충전기": 0, "사운드바": 0, "스피커": 0,
             "프린터": 0, "노트북": 0, "마우스": 0, "키보드": 0, "무선 청소기": 0, "유선 청소기": 0, "로봇청소기": 0, "헤어드라이어": 0, "리모콘": 0,
             "조리기구": 0, "티비(모니터포함)": 0, "공기청정기": 0, "가습기": 0, "침대": 0, "화장대": 0, "스탠드옷걸이": 0, "옷장": 0, "서랍": 0,
             "놀이매트": 0, "책상": 0, "의자": 0, "책장": 0, "소파": 0, "TV 장식장": 0, "카펫": 0, "피아노": 0, "실내자전기": 0, "선풍기": 0,
             "커피머신": 0, "냉장고": 0, "오븐": 0, "전자레인지": 0, "인덕션": 0, "식기세척기": 0, "드럼세탁기": 0, "전자동세탁기": 0, "테이블": 0,
             "싱크볼": 0, "토스터기": 0, "밥솥": 0, "욕조": 0, "세면대": 0, "샤워기": 0, "변기": 0, "스탠드에어컨": 0, "벽걸이에어컨": 0, "시스템에어컨": 0,
             "건조기": 0, "의류관리기": 0, "사람": 0, "강아지": 0, "고양이": 0}
}
key_first_letter = {
    "1933": ["A", "B"],
    "1942": ["C", "D"],
    "1944": ["E", "F"],
    "1945": ["G", "H"],
    "1946": ["I", "J"],
    "1947": ["K", "L"],
    "1948": ["M", "N"],
    "1949": ["O", "P"],
    "1950": ["Q", "R"],
    "1951": ["S", "T"],
    "1952": ["U", "V"],
    "1953": ["W", "X"]
}
task_id_list_detail = [1933, 1942, 1944, 1945, 1946, 1947, 1948, 1949, 1950, 1951, 1952, 1953]
# task_id_list_detail = [1933]

import datetime

now = datetime.datetime.now()
year = str(now.year)
month = str(now.month).zfill(2)
day = str(now.day).zfill(2)

EXT_PATH = "/Users/myeonghyeonjeong/Desktop/DATA_EXT/아크릴/사물촬영및바운딩(1587)/labeled_data_1587_" + year + month + day + "/"
EXT_PATH_LABELED = EXT_PATH + "labeled_data_1587_" + year + month + day + ".xlsx"

for task_id in task_id_list_detail:
    t_id = str(task_id)
    sql_result_json_detail = "SELECT result_json FROM TB_PRJ_DATA WHERE prj_idx =" + t_id + " AND prog_state_cd='ALL_FINISHED'"
    result_json_detail = getDatabaseData(sql_result_json_detail, "", "", "")

    for result_detail in result_json_detail:
        result_detail_dict = json.loads(result_detail[0])

        for label_detail in result_detail_dict['label-list']:
            try:
                for item_detail in item_list_detail[t_id]:
                    if label_detail['label'] == item_detail:
                        item_list_detail[t_id][item_detail] = item_list_detail[t_id][item_detail] + 1
            except KeyError:
                print("keyError", result_detail_dict['fileId'])
                pass

    # wb = openpyxl.Workbook('아크릴_데이터_수량_요약.xlsx')
    index = 1

    wb_detail[key_first_letter[t_id][0] + str(index)] = switch(task_id)

    for item_detail in item_list_detail[t_id]:
        index = index + 1

        name_key_detail = key_first_letter[t_id][0] + str(index)
        value_key_detail = key_first_letter[t_id][1] + str(index)

        wb_detail[name_key_detail] = item_detail
        wb_detail[value_key_detail] = item_list_detail[t_id][item_detail]

    wb.close()
    wb.save(EXT_PATH_LABELED)
